{
  "main": {
    "name": "Ciarán",
    "sirname": "Coady",
    "occupation": "Computer Science Student",
    "description": "A 3rd Year Computer Science student with a passion for tech, challenges and adventure!",
    "image": "ProfilePicture.jpg",
    "bio": "Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "ccoady@tcd.ie",
    "phone": "555-555-5555",
    "address": {
      "street": "(Your Street)",
      "city": "(Your City)",
      "state": "(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.ciarancoady.me",
    "resumedownload": "http://timbakerdev.com",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ciarancoady/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/ciarancoady98",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "Trinity College Dublin",
        "degree": "Integrated Computer Science",
        "graduated": "December 2022",
        "description": ""
      },
      {
        "school": "Castlecomer Community School",
        "degree": "Leaving Certificate 565 points",
        "graduated": "June 2017",
        "description": "Describe your experience at school, what you learned, what useful skills you have acquired etc."
      }
    ],
    "work": [
      {
        "company": "Trinity College Dublin IT Services",
        "title": "App and AI Development Intern",
        "years": "June 2019 - Present",
        "description": "I work as part of the team developing, maintaining and testing the TCD student app \"Trinity Live\". As part of this position I worked with Nodejs, Microsoft Q&A maker, React Native, Android (Java), iOS and Cisco Mobility Services Engine. My duties in this position include: -Design and development of new features for the Trinity Live mobile app. -UI & UX design and development. -Maintaining a code base. -Perform peer code reviews. -Perform release management tasks. -Architect and follow a development lifecycle/pipeline. -Log & Fix bugs and deal with support issues as they arise. -Writing formal documentation. -Build test data/environments as necessary to test the application. -Perform Unit & Functional testing. "
      },
      {
        "company": "Trinity College Dublin",
        "title": "Undergraduate Lab Demonstrator",
        "years": "September 2019 - Present",
        "description": "As part of my third year studying computer science, I decided to take on the role of undergraduate lab demonstrator. For me this was an opportunity to give back to the course in which I am studying and help fellow students. The purpose of a Demonstrator is to aid the students in their learning. To achieve this I attend the tutorial and lab sessions for the module and walk around the room answering students questions, and helping them overcome any problems they may be having. Introduction To Programming teaches students about the Java and the fundamentals of object oriented programming. "
      },
      {
        "company": "Coder Dojo | Castlecomer Community School",
        "title": "Mentor",
        "years": "October 2012 – May 2017",
        "description": "When I started secondary school I noticed that there was no facility where I could learn code in my locality. I mentioned this in my school and after expressing continued interest I was given the option to help set up a coder dojo club. The school vice principal organized the club and provided the computer lab as a venue. While I suggested some projects that might be interesting to develop. After the first successful year of the club I had developed some games such as space invaders and snake in Python using the pygame (https://www.pygame.org/) library. Early that summer, I went to some local primary schools to explain details about the club and demonstrate some of the projects I had developed. After 2 years I became a mentor in the club helping teach new members coding concepts such as variables and loops, along with some debugging. This experience vastly improved my interpersonal skills and improved my ability to teach and explain code and other concepts to people who had no prior knowledge."
      },
      {
        "company": "Trinity College Dublin",
        "title": "Student",
        "years": "January 2018 – May 2018",
        "description": "As part of my ICS course we had a group programming module where we had to develop a system similar to the website yelp (https://www.yelp.ie/). The project was developed using a library for java called processing (https://processing.org/) We were given two data sets, one small (about 20 data points) and one large (100,000+ data points). Our task was to use either data set and produce a backend search and sorting system (so users could query for information about various businesses) along with a frontend UI to display information graphically such as reviews. I proposed to our group that we use the larger data set and as a result I researched and implemented the backend code used to query that data set using SQLite. From this project I gained experience in group and pair programming, SQL, understanding others code and using an SVN repository. This also made clear to me the importance of documenting your code and following a coding standard."
      },
      {
        "company": "Doyles Wholesale Kilkenny",
        "title": "Warehouse Floor Staff",
        "years": "June 2016 – August 2016",
        "description": "My position involved diagnosing and repairing hardware and software problems with various devices, mainly pc's and laptops. I worked as part of a pair with one other student. We dynamically divided the workload and helped each other when needed for difficult tasks. Most repairs involved locating malware and removing it, or screen replacements on mobile devices. From this position I gained some experience interacting with the general public when taking in new repair items. This improved my communication skills as I was required to get information from each customer about the exact problem they were having."
      },
      {
        "company": "Quinn Computers Kilkenny",
        "title": "Repair Technician",
        "years": "May 2015 – May 2015",
        "description": "This employment involved preparing and shipping orders from customers made online. Each order would be received from the sales department with details of the order items and quantities. I would then print the order and change its status to processing. After this I would interact with the stock system and check if stock was available, if so I would go locate the item in the warehouse. If the item was not available I would add it to the back order list. After I had fetched the order, I would then manually package it and print the shipping label. Once complete the order would be added to a basket of outgoing orders and its status changed to complete. I saw opportunities to automate parts of my job, such as changing the status of orders and inputting items into the back order list. I did this using a small script in the program autohotkey. This gave me great experience in a large scale business and also some of the background workings of online shopping systems with real world time pressures and several dependencies. "
      },
      {
        "company": "Institute Of Technology Carlow",
        "title": "General Assistant",
        "years": "March 2015 – March 2015",
        "description": "This was the second week of work experience in my 4th year of Secondary School. For this week I spent some time shadowing the head of the School of Engineering, assisting him in his day to day tasks. I also got a flavor of various aspects of computer engineering during this time. This included first hand experience with troubleshooting and repairing college network equipment, a small insight into management and some hands on experience with soldering and designing printed circuits. I also had the opportunity to sit into some lectures along with participating in some 1st year lab assignments."
      },
      {
        "company": "Waterford Institute Of Technology",
        "title": "Software Developer",
        "years": "November 2014 – November 2014",
        "description": "This was the first week of work experience in my 4th year of Secondary School. I was inducted onto a project team working in the robotics department of WIT. This project was an educational program to introduce robotics into primary and secondary schools. My position involved prototyping code to be used during demonstrations, as well as modifying and testing robotic equipment. I worked with other students and lecturers involved in the robotics/engineering department, doing background research on the project as part of a group. I had the role of providing a different viewpoint as a secondary school student. At the end of the week I gave a short presentation of my work, followed by a Q&A session."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Illustrator",
        "level": "55%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "VueJs",
        "level": "50%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Canadian Wanderlust",
        "category": "My Travel Blog for my post-university travels",
        "image": "canadian-wanderlust.jpg",
        "url": "https://www.canadianwanderlust.com"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Smirkspace",
        "category": "(MVP Only) A React and Meteor based chat University project.",
        "image": "smirkspace.jpg",
        "url": "http://www.smirkspace.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
